NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_global.h
/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF7120_GLOBAL_H
#define NRF7120_GLOBAL_H

#ifdef __cplusplus
    extern "C" {
#endif


/* ========================================= Start of section using anonymous unions ========================================= */

#include "../../common/compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_WICR_NS_BASE                  0x003FD000UL
#define NRF_FICR_NS_BASE                  0x00FFC000UL
#define NRF_UICR_S_BASE                   0x00FFD000UL
#define NRF_SICR_S_BASE                   0x00FFE000UL
#define NRF_CRACENCORE_S_BASE             0x50010000UL
#define NRF_USBHSCORE_NS_BASE             0x40020000UL
#define NRF_USBHSCORE_S_BASE              0x50020000UL
#define NRF_SPU00_S_BASE                  0x50040000UL
#define NRF_MPC00_S_BASE                  0x50041000UL
#define NRF_DPPIC00_NS_BASE               0x40042000UL
#define NRF_DPPIC00_S_BASE                0x50042000UL
#define NRF_MPC03_S_BASE                  0x50043000UL
#define NRF_PPIB00_NS_BASE                0x40044000UL
#define NRF_PPIB00_S_BASE                 0x50044000UL
#define NRF_PPIB01_NS_BASE                0x40045000UL
#define NRF_PPIB01_S_BASE                 0x50045000UL
#define NRF_KMU_S_BASE                    0x50049000UL
#define NRF_AAR00_NS_BASE                 0x4004A000UL
#define NRF_CCM00_NS_BASE                 0x4004A000UL
#define NRF_AAR00_S_BASE                  0x5004A000UL
#define NRF_CCM00_S_BASE                  0x5004A000UL
#define NRF_ECB00_NS_BASE                 0x4004B000UL
#define NRF_ECB00_S_BASE                  0x5004B000UL
#define NRF_VPR00_NS_BASE                 0x4004C000UL
#define NRF_VPR00_S_BASE                  0x5004C000UL
#define NRF_SPIM00_NS_BASE                0x4004D000UL
#define NRF_SPIS00_NS_BASE                0x4004D000UL
#define NRF_UARTE00_NS_BASE               0x4004D000UL
#define NRF_SPIM00_S_BASE                 0x5004D000UL
#define NRF_SPIS00_S_BASE                 0x5004D000UL
#define NRF_UARTE00_S_BASE                0x5004D000UL
#define NRF_MRAMC_S_BASE                  0x5004E000UL
#define NRF_P2_NS_BASE                    0x40050400UL
#define NRF_GPIOHSPADCTRL_S_BASE          0x50050400UL
#define NRF_P2_S_BASE                     0x50050400UL
#define NRF_CTRLAP_NS_BASE                0x40052000UL
#define NRF_CTRLAP_S_BASE                 0x50052000UL
#define NRF_TAD_NS_BASE                   0x40053000UL
#define NRF_TAD_S_BASE                    0x50053000UL
#define NRF_TIMER00_NS_BASE               0x40055000UL
#define NRF_TIMER00_S_BASE                0x50055000UL
#define NRF_EGU00_NS_BASE                 0x40058000UL
#define NRF_EGU00_S_BASE                  0x50058000UL
#define NRF_CRACEN_S_BASE                 0x50059000UL
#define NRF_USBHS_NS_BASE                 0x4005A000UL
#define NRF_USBHS_S_BASE                  0x5005A000UL
#define NRF_MSPI00_NS_BASE                0x4005B000UL
#define NRF_MSPI00_S_BASE                 0x5005B000UL
#define NRF_MSPI01_NS_BASE                0x4005C000UL
#define NRF_MSPI01_S_BASE                 0x5005C000UL
#define NRF_SPIM01_NS_BASE                0x4005D000UL
#define NRF_SPIS01_NS_BASE                0x4005D000UL
#define NRF_SPIM01_S_BASE                 0x5005D000UL
#define NRF_SPIS01_S_BASE                 0x5005D000UL
#define NRF_SPU10_S_BASE                  0x50080000UL
#define NRF_DPPIC10_NS_BASE               0x40082000UL
#define NRF_DPPIC10_S_BASE                0x50082000UL
#define NRF_PPIB10_NS_BASE                0x40083000UL
#define NRF_PPIB10_S_BASE                 0x50083000UL
#define NRF_PPIB11_NS_BASE                0x40084000UL
#define NRF_PPIB11_S_BASE                 0x50084000UL
#define NRF_TIMER10_NS_BASE               0x40085000UL
#define NRF_TIMER10_S_BASE                0x50085000UL
#define NRF_EGU10_NS_BASE                 0x40087000UL
#define NRF_EGU10_S_BASE                  0x50087000UL
#define NRF_RADIO_NS_BASE                 0x4008A000UL
#define NRF_RADIO_S_BASE                  0x5008A000UL
#define NRF_IPCT10_NS_BASE                0x4008D000UL
#define NRF_IPCT10_S_BASE                 0x5008D000UL
#define NRF_SPU20_S_BASE                  0x500C0000UL
#define NRF_DPPIC20_NS_BASE               0x400C2000UL
#define NRF_DPPIC20_S_BASE                0x500C2000UL
#define NRF_PPIB20_NS_BASE                0x400C3000UL
#define NRF_PPIB20_S_BASE                 0x500C3000UL
#define NRF_PPIB21_NS_BASE                0x400C4000UL
#define NRF_PPIB21_S_BASE                 0x500C4000UL
#define NRF_PPIB22_NS_BASE                0x400C5000UL
#define NRF_PPIB22_S_BASE                 0x500C5000UL
#define NRF_SPIM20_NS_BASE                0x400C6000UL
#define NRF_SPIS20_NS_BASE                0x400C6000UL
#define NRF_TWIM20_NS_BASE                0x400C6000UL
#define NRF_TWIS20_NS_BASE                0x400C6000UL
#define NRF_UARTE20_NS_BASE               0x400C6000UL
#define NRF_SPIM20_S_BASE                 0x500C6000UL
#define NRF_SPIS20_S_BASE                 0x500C6000UL
#define NRF_TWIM20_S_BASE                 0x500C6000UL
#define NRF_TWIS20_S_BASE                 0x500C6000UL
#define NRF_UARTE20_S_BASE                0x500C6000UL
#define NRF_SPIM21_NS_BASE                0x400C7000UL
#define NRF_SPIS21_NS_BASE                0x400C7000UL
#define NRF_TWIM21_NS_BASE                0x400C7000UL
#define NRF_TWIS21_NS_BASE                0x400C7000UL
#define NRF_UARTE21_NS_BASE               0x400C7000UL
#define NRF_SPIM21_S_BASE                 0x500C7000UL
#define NRF_SPIS21_S_BASE                 0x500C7000UL
#define NRF_TWIM21_S_BASE                 0x500C7000UL
#define NRF_TWIS21_S_BASE                 0x500C7000UL
#define NRF_UARTE21_S_BASE                0x500C7000UL
#define NRF_SPIM22_NS_BASE                0x400C8000UL
#define NRF_SPIS22_NS_BASE                0x400C8000UL
#define NRF_TWIM22_NS_BASE                0x400C8000UL
#define NRF_TWIS22_NS_BASE                0x400C8000UL
#define NRF_UARTE22_NS_BASE               0x400C8000UL
#define NRF_SPIM22_S_BASE                 0x500C8000UL
#define NRF_SPIS22_S_BASE                 0x500C8000UL
#define NRF_TWIM22_S_BASE                 0x500C8000UL
#define NRF_TWIS22_S_BASE                 0x500C8000UL
#define NRF_UARTE22_S_BASE                0x500C8000UL
#define NRF_EGU20_NS_BASE                 0x400C9000UL
#define NRF_EGU20_S_BASE                  0x500C9000UL
#define NRF_TIMER20_NS_BASE               0x400CA000UL
#define NRF_TIMER20_S_BASE                0x500CA000UL
#define NRF_TIMER21_NS_BASE               0x400CB000UL
#define NRF_TIMER21_S_BASE                0x500CB000UL
#define NRF_TIMER22_NS_BASE               0x400CC000UL
#define NRF_TIMER22_S_BASE                0x500CC000UL
#define NRF_TIMER23_NS_BASE               0x400CD000UL
#define NRF_TIMER23_S_BASE                0x500CD000UL
#define NRF_TIMER24_NS_BASE               0x400CE000UL
#define NRF_TIMER24_S_BASE                0x500CE000UL
#define NRF_MEMCONF_NS_BASE               0x400CF000UL
#define NRF_MEMCONF_S_BASE                0x500CF000UL
#define NRF_PDM20_NS_BASE                 0x400D0000UL
#define NRF_PDM20_S_BASE                  0x500D0000UL
#define NRF_PDM21_NS_BASE                 0x400D1000UL
#define NRF_PDM21_S_BASE                  0x500D1000UL
#define NRF_PWM20_NS_BASE                 0x400D2000UL
#define NRF_PWM20_S_BASE                  0x500D2000UL
#define NRF_PWM21_NS_BASE                 0x400D3000UL
#define NRF_PWM21_S_BASE                  0x500D3000UL
#define NRF_PWM22_NS_BASE                 0x400D4000UL
#define NRF_PWM22_S_BASE                  0x500D4000UL
#define NRF_SAADC_NS_BASE                 0x400D5000UL
#define NRF_SAADC_S_BASE                  0x500D5000UL
#define NRF_NFCT_NS_BASE                  0x400D6000UL
#define NRF_NFCT_S_BASE                   0x500D6000UL
#define NRF_TEMP_NS_BASE                  0x400D7000UL
#define NRF_TEMP_S_BASE                   0x500D7000UL
#define NRF_P1_NS_BASE                    0x400D8200UL
#define NRF_P3_NS_BASE                    0x400D8600UL
#define NRF_P4_NS_BASE                    0x400D8800UL
#define NRF_P1_S_BASE                     0x500D8200UL
#define NRF_P3_S_BASE                     0x500D8600UL
#define NRF_P4_S_BASE                     0x500D8800UL
#define NRF_GPIOTE20_NS_BASE              0x400DA000UL
#define NRF_GPIOTE20_S_BASE               0x500DA000UL
#define NRF_QDEC20_NS_BASE                0x400E0000UL
#define NRF_QDEC20_S_BASE                 0x500E0000UL
#define NRF_QDEC21_NS_BASE                0x400E1000UL
#define NRF_QDEC21_S_BASE                 0x500E1000UL
#define NRF_GRTC_NS_BASE                  0x400E2000UL
#define NRF_GRTC_S_BASE                   0x500E2000UL
#define NRF_TDM_NS_BASE                   0x400E8000UL
#define NRF_TDM_S_BASE                    0x500E8000UL
#define NRF_SPIM23_NS_BASE                0x400ED000UL
#define NRF_SPIS23_NS_BASE                0x400ED000UL
#define NRF_TWIM23_NS_BASE                0x400ED000UL
#define NRF_TWIS23_NS_BASE                0x400ED000UL
#define NRF_UARTE23_NS_BASE               0x400ED000UL
#define NRF_SPIM23_S_BASE                 0x500ED000UL
#define NRF_SPIS23_S_BASE                 0x500ED000UL
#define NRF_TWIM23_S_BASE                 0x500ED000UL
#define NRF_TWIS23_S_BASE                 0x500ED000UL
#define NRF_UARTE23_S_BASE                0x500ED000UL
#define NRF_SPIM24_NS_BASE                0x400EE000UL
#define NRF_SPIS24_NS_BASE                0x400EE000UL
#define NRF_TWIM24_NS_BASE                0x400EE000UL
#define NRF_TWIS24_NS_BASE                0x400EE000UL
#define NRF_UARTE24_NS_BASE               0x400EE000UL
#define NRF_SPIM24_S_BASE                 0x500EE000UL
#define NRF_SPIS24_S_BASE                 0x500EE000UL
#define NRF_TWIM24_S_BASE                 0x500EE000UL
#define NRF_TWIS24_S_BASE                 0x500EE000UL
#define NRF_UARTE24_S_BASE                0x500EE000UL
#define NRF_TAMPC_S_BASE                  0x500EF000UL
#define NRF_COEXC_NS_BASE                 0x400F1000UL
#define NRF_COEXC_S_BASE                  0x500F1000UL
#define NRF_SPU30_S_BASE                  0x50100000UL
#define NRF_DPPIC30_NS_BASE               0x40102000UL
#define NRF_DPPIC30_S_BASE                0x50102000UL
#define NRF_PPIB30_NS_BASE                0x40103000UL
#define NRF_PPIB30_S_BASE                 0x50103000UL
#define NRF_SPIM30_NS_BASE                0x40104000UL
#define NRF_SPIS30_NS_BASE                0x40104000UL
#define NRF_TWIM30_NS_BASE                0x40104000UL
#define NRF_TWIS30_NS_BASE                0x40104000UL
#define NRF_UARTE30_NS_BASE               0x40104000UL
#define NRF_SPIM30_S_BASE                 0x50104000UL
#define NRF_SPIS30_S_BASE                 0x50104000UL
#define NRF_TWIM30_S_BASE                 0x50104000UL
#define NRF_TWIS30_S_BASE                 0x50104000UL
#define NRF_UARTE30_S_BASE                0x50104000UL
#define NRF_COMP_NS_BASE                  0x40106000UL
#define NRF_LPCOMP_NS_BASE                0x40106000UL
#define NRF_COMP_S_BASE                   0x50106000UL
#define NRF_LPCOMP_S_BASE                 0x50106000UL
#define NRF_WDT30_S_BASE                  0x50108000UL
#define NRF_WDT31_NS_BASE                 0x40109000UL
#define NRF_WDT31_S_BASE                  0x50109000UL
#define NRF_P0_NS_BASE                    0x4010A000UL
#define NRF_P0_S_BASE                     0x5010A000UL
#define NRF_GPIOTE30_NS_BASE              0x4010C000UL
#define NRF_GPIOTE30_S_BASE               0x5010C000UL
#define NRF_CLOCK_NS_BASE                 0x4010E000UL
#define NRF_POWER_NS_BASE                 0x4010E000UL
#define NRF_RESET_NS_BASE                 0x4010E000UL
#define NRF_CLOCK_S_BASE                  0x5010E000UL
#define NRF_POWER_S_BASE                  0x5010E000UL
#define NRF_RESET_S_BASE                  0x5010E000UL
#define NRF_GLITCHDET_S_BASE              0x50111000UL
#define NRF_OSCILLATORS_NS_BASE           0x40120000UL
#define NRF_REGULATORS_NS_BASE            0x40120000UL
#define NRF_OSCILLATORS_S_BASE            0x50120000UL
#define NRF_REGULATORS_S_BASE             0x50120000UL
#define NRF_VREGUSB_NS_BASE               0x40121000UL
#define NRF_VREGUSB_S_BASE                0x50121000UL
#define NRF_LFXO_NS_BASE                  0x40122000UL
#define NRF_LFXO_S_BASE                   0x50122000UL
#define NRF_LFRC_NS_BASE                  0x40123000UL
#define NRF_LFRC_S_BASE                   0x50123000UL
#define NRF_HFXO64M_NS_BASE               0x40124000UL
#define NRF_HFXO64M_S_BASE                0x50124000UL
#define NRF_OSCRFR_NS_BASE                0x4012A000UL
#define NRF_OSCRFR_S_BASE                 0x5012A000UL
#define NRF_AUXPLL_NS_BASE                0x40130000UL
#define NRF_AUXPM_NS_BASE                 0x40130000UL
#define NRF_AUXPLL_S_BASE                 0x50130000UL
#define NRF_AUXPM_S_BASE                  0x50130000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

